TI ARM Assembler PC v5.0.4 Tue Dec 10 12:38:37 2013

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
main.asm                                                             PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                             PC v5.0.4 *
       3                    ;* Date/Time created: Tue Dec 10 12:38:37 2013                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=on --code_state=16 --disable_dual_state --e
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../main.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v5.0.4 Copyright (c) 1996-2013 Te
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("H:\EECS_388\TI_ARM_Projects\Lab8_FreeRTOS_EvalBot\Debug")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("SysCtlPeripheralEnable")

    1394                    $C$DW$140       .dwtag  DW_TAG_enumerator, DW_AT_name("eRunning"), DW_AT_const_value(0x00)
    1395                            .dwattr $C$DW$140, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Lab8_FreeRTOS_EvalBot/Source/i
    1396                            .dwattr $C$DW$140, DW_AT_decl_line(0x90)
    1397                            .dwattr $C$DW$140, DW_AT_decl_column(0x02)
    1398                    $C$DW$141       .dwtag  DW_TAG_enumerator, DW_AT_name("eReady"), DW_AT_const_value(0x01)
    1399                            .dwattr $C$DW$141, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Lab8_FreeRTOS_EvalBot/Source/i
    1400                            .dwattr $C$DW$141, DW_AT_decl_line(0x91)
    1401                            .dwattr $C$DW$141, DW_AT_decl_column(0x02)
    1402                    $C$DW$142       .dwtag  DW_TAG_enumerator, DW_AT_name("eBlocked"), DW_AT_const_value(0x02)
    1403                            .dwattr $C$DW$142, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Lab8_FreeRTOS_EvalBot/Source/i
    1404                            .dwattr $C$DW$142, DW_AT_decl_line(0x92)
    1405                            .dwattr $C$DW$142, DW_AT_decl_column(0x02)
    1406                    $C$DW$143       .dwtag  DW_TAG_enumerator, DW_AT_name("eSuspended"), DW_AT_const_value(0x03)
    1407                            .dwattr $C$DW$143, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Lab8_FreeRTOS_EvalBot/Source/i
    1408                            .dwattr $C$DW$143, DW_AT_decl_line(0x93)
    1409                            .dwattr $C$DW$143, DW_AT_decl_column(0x02)
    1410                    $C$DW$144       .dwtag  DW_TAG_enumerator, DW_AT_name("eDeleted"), DW_AT_const_value(0x04)
    1411                            .dwattr $C$DW$144, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Lab8_FreeRTOS_EvalBot/Source/i
    1412                            .dwattr $C$DW$144, DW_AT_decl_line(0x94)
    1413                            .dwattr $C$DW$144, DW_AT_decl_column(0x02)
    1414                            .dwendtag $C$DW$T$51
    1415                    
TI ARM Assembler PC v5.0.4 Tue Dec 10 12:38:37 2013

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
main.asm                                                             PAGE   28

    1416                            .dwattr $C$DW$T$51, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Lab8_FreeRTOS_EvalBot/Source/
    1417                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x8f)
    1418                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x01)
    1419                    $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("eTaskState")
    1420                            .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    1421                            .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    1422                            .dwattr $C$DW$T$52, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Lab8_FreeRTOS_EvalBot/Source/
    1423                            .dwattr $C$DW$T$52, DW_AT_decl_line(0x95)
    1424                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x03)
    1425                    
    1426                    $C$DW$T$53      .dwtag  DW_TAG_enumeration_type
    1427                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x01)
    1428                    $C$DW$145       .dwtag  DW_TAG_enumerator, DW_AT_name("eAbortSleep"), DW_AT_const_value(0x00)
    1429                            .dwattr $C$DW$145, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Lab8_FreeRTOS_EvalBot/Source/i
    1430                            .dwattr $C$DW$145, DW_AT_decl_line(0x9a)
    1431                            .dwattr $C$DW$145, DW_AT_decl_column(0x02)
    1432                    $C$DW$146       .dwtag  DW_TAG_enumerator, DW_AT_name("eStandardSleep"), DW_AT_const_value(0x01)
    1433                            .dwattr $C$DW$146, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Lab8_FreeRTOS_EvalBot/Source/i
    1434                            .dwattr $C$DW$146, DW_AT_decl_line(0x9b)
    1435                            .dwattr $C$DW$146, DW_AT_decl_column(0x02)
    1436                    $C$DW$147       .dwtag  DW_TAG_enumerator, DW_AT_name("eNoTasksWaitingTimeout"), DW_AT_const_value(0x0
    1437                            .dwattr $C$DW$147, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Lab8_FreeRTOS_EvalBot/Source/i
    1438                            .dwattr $C$DW$147, DW_AT_decl_line(0x9c)
    1439                            .dwattr $C$DW$147, DW_AT_decl_column(0x02)
    1440                            .dwendtag $C$DW$T$53
    1441                    
    1442                            .dwattr $C$DW$T$53, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Lab8_FreeRTOS_EvalBot/Source/
    1443                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x99)
    1444                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x01)
    1445                    $C$DW$T$54      .dwtag  DW_TAG_typedef, DW_AT_name("eSleepModeStatus")
    1446                            .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    1447                            .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    1448                            .dwattr $C$DW$T$54, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Lab8_FreeRTOS_EvalBot/Source/
    1449                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x9d)
    1450                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x03)
    1451                    
    1452                    $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1453                            .dwattr $C$DW$T$20, DW_AT_byte_size(0x18)
    1454                    $C$DW$148       .dwtag  DW_TAG_member
    1455                            .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$10)
    1456                            .dwattr $C$DW$148, DW_AT_name("fd")
    1457                            .dwattr $C$DW$148, DW_AT_TI_symbol_name("fd")
    1458                            .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1459                            .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1460                            .dwattr $C$DW$148, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/
    1461                            .dwattr $C$DW$148, DW_AT_decl_line(0x5b)
    1462                            .dwattr $C$DW$148, DW_AT_decl_column(0x0b)
    1463                    $C$DW$149       .dwtag  DW_TAG_member
    1464                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1465                            .dwattr $C$DW$149, DW_AT_name("buf")
    1466                            .dwattr $C$DW$149, DW_AT_TI_symbol_name("buf")
    1467                            .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1468                            .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1469                            .dwattr $C$DW$149, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/
    1470                            .dwattr $C$DW$149, DW_AT_decl_line(0x5c)
TI ARM Assembler PC v5.0.4 Tue Dec 10 12:38:37 2013

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
main.asm                                                             PAGE   29

    1471                            .dwattr $C$DW$149, DW_AT_decl_column(0x16)
    1472                    $C$DW$150       .dwtag  DW_TAG_member
    1473                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1474                            .dwattr $C$DW$150, DW_AT_name("pos")
    1475                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("pos")
    1476                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1477                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1478                            .dwattr $C$DW$150, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/
    1479                            .dwattr $C$DW$150, DW_AT_decl_line(0x5d)
    1480                            .dwattr $C$DW$150, DW_AT_decl_column(0x16)
    1481                    $C$DW$151       .dwtag  DW_TAG_member
    1482                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1483                            .dwattr $C$DW$151, DW_AT_name("bufend")
    1484                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("bufend")
    1485                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1486                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1487                            .dwattr $C$DW$151, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/
    1488                            .dwattr $C$DW$151, DW_AT_decl_line(0x5e)
    1489                            .dwattr $C$DW$151, DW_AT_decl_column(0x16)
    1490                    $C$DW$152       .dwtag  DW_TAG_member
    1491                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1492                            .dwattr $C$DW$152, DW_AT_name("buff_stop")
    1493                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("buff_stop")
    1494                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1495                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1496                            .dwattr $C$DW$152, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/
    1497                            .dwattr $C$DW$152, DW_AT_decl_line(0x5f)
    1498                            .dwattr $C$DW$152, DW_AT_decl_column(0x16)
    1499                    $C$DW$153       .dwtag  DW_TAG_member
    1500                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$11)
    1501                            .dwattr $C$DW$153, DW_AT_name("flags")
    1502                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("flags")
    1503                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1504                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1505                            .dwattr $C$DW$153, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/
    1506                            .dwattr $C$DW$153, DW_AT_decl_line(0x60)
    1507                            .dwattr $C$DW$153, DW_AT_decl_column(0x16)
    1508                            .dwendtag $C$DW$T$20
    1509                    
    1510                            .dwattr $C$DW$T$20, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
    1511                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x5a)
    1512                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
    1513                    $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("FILE")
    1514                            .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$20)
    1515                            .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    1516                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
    1517                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x61)
    1518                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x03)
    1519                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    1520                            .dwattr $C$DW$T$2, DW_AT_name("void")
    1521                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    1522                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    1523                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    1524                    $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("xTaskHandle")
    1525                            .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$3)
TI ARM Assembler PC v5.0.4 Tue Dec 10 12:38:37 2013

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
main.asm                                                             PAGE   30

    1526                            .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    1527                            .dwattr $C$DW$T$56, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Lab8_FreeRTOS_EvalBot/Source/
    1528                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x6a)
    1529                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x10)
    1530                    $C$DW$T$57      .dwtag  DW_TAG_pointer_type
    1531                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    1532                            .dwattr $C$DW$T$57, DW_AT_address_class(0x20)
    1533                    
    1534                    $C$DW$T$38      .dwtag  DW_TAG_subroutine_type
    1535                            .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    1536                    $C$DW$154       .dwtag  DW_TAG_formal_parameter
    1537                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$3)
    1538                            .dwendtag $C$DW$T$38
    1539                    
    1540                    $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    1541                            .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    1542                            .dwattr $C$DW$T$39, DW_AT_address_class(0x20)
    1543                    $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("pdTASK_CODE")
    1544                            .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    1545                            .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    1546                            .dwattr $C$DW$T$40, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Lab8_FreeRTOS_EvalBot\Source\
    1547                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x4f)
    1548                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    1549                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    1550                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1551                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    1552                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1553                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    1554                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1555                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1556                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1557                    $C$DW$T$41      .dwtag  DW_TAG_const_type
    1558                            .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$5)
    1559                    $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    1560                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    1561                            .dwattr $C$DW$T$42, DW_AT_address_class(0x20)
    1562                    $C$DW$T$43      .dwtag  DW_TAG_const_type
    1563                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    1564                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    1565                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1566                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1567                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1568                    $C$DW$T$19      .dwtag  DW_TAG_pointer_type
    1569                            .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$6)
    1570                            .dwattr $C$DW$T$19, DW_AT_address_class(0x20)
    1571                    $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("tBoolean")
    1572                            .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$6)
    1573                            .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    1574                            .dwattr $C$DW$T$71, DW_AT_decl_file("C:/TI_CodeComposer/Stellaris-EVALBOT/inc/hw_types.h")
    1575                            .dwattr $C$DW$T$71, DW_AT_decl_line(0x30)
    1576                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x17)
    1577                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    1578                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1579                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1580                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
TI ARM Assembler PC v5.0.4 Tue Dec 10 12:38:37 2013

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
main.asm                                                             PAGE   31

    1581                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    1582                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1583                            .dwattr $C$DW$T$8, DW_AT_name("short")
    1584                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    1585                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    1586                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1587                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1588                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    1589                    $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
    1590                            .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$9)
    1591                            .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    1592                            .dwattr $C$DW$T$93, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
    1593                            .dwattr $C$DW$T$93, DW_AT_decl_line(0x3c)
    1594                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x1a)
    1595                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    1596                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1597                            .dwattr $C$DW$T$10, DW_AT_name("int")
    1598                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    1599                    $C$DW$T$98      .dwtag  DW_TAG_typedef, DW_AT_name("ptrdiff_t")
    1600                            .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$10)
    1601                            .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    1602                            .dwattr $C$DW$T$98, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
    1603                            .dwattr $C$DW$T$98, DW_AT_decl_line(0x31)
    1604                            .dwattr $C$DW$T$98, DW_AT_decl_column(0x1c)
    1605                    $C$DW$T$11      .dwtag  DW_TAG_base_type
    1606                            .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1607                            .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    1608                            .dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
    1609                    $C$DW$T$99      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    1610                            .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$11)
    1611                            .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
    1612                            .dwattr $C$DW$T$99, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
    1613                            .dwattr $C$DW$T$99, DW_AT_decl_line(0x35)
    1614                            .dwattr $C$DW$T$99, DW_AT_decl_column(0x19)
    1615                    $C$DW$T$12      .dwtag  DW_TAG_base_type
    1616                            .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    1617                            .dwattr $C$DW$T$12, DW_AT_name("long")
    1618                            .dwattr $C$DW$T$12, DW_AT_byte_size(0x04)
    1619                    $C$DW$T$107     .dwtag  DW_TAG_volatile_type
    1620                            .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$12)
    1621                    
    1622                    $C$DW$T$108     .dwtag  DW_TAG_subroutine_type
    1623                            .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$12)
    1624                            .dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
    1625                    $C$DW$155       .dwtag  DW_TAG_formal_parameter
    1626                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$3)
    1627                            .dwendtag $C$DW$T$108
    1628                    
    1629                    $C$DW$T$109     .dwtag  DW_TAG_pointer_type
    1630                            .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$108)
    1631                            .dwattr $C$DW$T$109, DW_AT_address_class(0x20)
    1632                    $C$DW$T$110     .dwtag  DW_TAG_typedef, DW_AT_name("pdTASK_HOOK_CODE")
    1633                            .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$109)
    1634                            .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
    1635                            .dwattr $C$DW$T$110, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Lab8_FreeRTOS_EvalBot/Source
TI ARM Assembler PC v5.0.4 Tue Dec 10 12:38:37 2013

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
main.asm                                                             PAGE   32

    1636                            .dwattr $C$DW$T$110, DW_AT_decl_line(0x66)
    1637                            .dwattr $C$DW$T$110, DW_AT_decl_column(0x19)
    1638                    $C$DW$T$111     .dwtag  DW_TAG_typedef, DW_AT_name("fpos_t")
    1639                            .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$12)
    1640                            .dwattr $C$DW$T$111, DW_AT_language(DW_LANG_C)
    1641                            .dwattr $C$DW$T$111, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/includ
    1642                            .dwattr $C$DW$T$111, DW_AT_decl_line(0x6d)
    1643                            .dwattr $C$DW$T$111, DW_AT_decl_column(0x0e)
    1644                    $C$DW$T$13      .dwtag  DW_TAG_base_type
    1645                            .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1646                            .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    1647                            .dwattr $C$DW$T$13, DW_AT_byte_size(0x04)
    1648                    $C$DW$T$25      .dwtag  DW_TAG_volatile_type
    1649                            .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$13)
    1650                    $C$DW$T$44      .dwtag  DW_TAG_pointer_type
    1651                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$13)
    1652                            .dwattr $C$DW$T$44, DW_AT_address_class(0x20)
    1653                    $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("portTickType")
    1654                            .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$13)
    1655                            .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    1656                            .dwattr $C$DW$T$32, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Lab8_FreeRTOS_EvalBot\Source\
    1657                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x6a)
    1658                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x1c)
    1659                    $C$DW$T$86      .dwtag  DW_TAG_pointer_type
    1660                            .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$32)
    1661                            .dwattr $C$DW$T$86, DW_AT_address_class(0x20)
    1662                    $C$DW$T$87      .dwtag  DW_TAG_const_type
    1663                            .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    1664                    $C$DW$T$14      .dwtag  DW_TAG_base_type
    1665                            .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    1666                            .dwattr $C$DW$T$14, DW_AT_name("long long")
    1667                            .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
    1668                    $C$DW$T$15      .dwtag  DW_TAG_base_type
    1669                            .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    1670                            .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    1671                            .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
    1672                    $C$DW$T$16      .dwtag  DW_TAG_base_type
    1673                            .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    1674                            .dwattr $C$DW$T$16, DW_AT_name("float")
    1675                            .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
    1676                    $C$DW$T$17      .dwtag  DW_TAG_base_type
    1677                            .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    1678                            .dwattr $C$DW$T$17, DW_AT_name("double")
    1679                            .dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
    1680                    $C$DW$T$18      .dwtag  DW_TAG_base_type
    1681                            .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    1682                            .dwattr $C$DW$T$18, DW_AT_name("long double")
    1683                            .dwattr $C$DW$T$18, DW_AT_byte_size(0x08)
    1684                    $C$DW$T$66      .dwtag  DW_TAG_base_type
    1685                            .dwattr $C$DW$T$66, DW_AT_encoding(DW_ATE_unsigned_char)
    1686                            .dwattr $C$DW$T$66, DW_AT_name("unsigned char")
    1687                            .dwattr $C$DW$T$66, DW_AT_byte_size(0x01)
    1688                    $C$DW$T$67      .dwtag  DW_TAG_const_type
    1689                            .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
    1690                    $C$DW$T$68      .dwtag  DW_TAG_pointer_type
TI ARM Assembler PC v5.0.4 Tue Dec 10 12:38:37 2013

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
main.asm                                                             PAGE   33

    1691                            .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
    1692                            .dwattr $C$DW$T$68, DW_AT_address_class(0x20)
    1693                    $C$DW$T$94      .dwtag  DW_TAG_pointer_type
    1694                            .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$66)
    1695                            .dwattr $C$DW$T$94, DW_AT_address_class(0x20)
    1696                    
    1697                    $C$DW$T$116     .dwtag  DW_TAG_array_type
    1698                            .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$66)
    1699                            .dwattr $C$DW$T$116, DW_AT_language(DW_LANG_C)
    1700                            .dwattr $C$DW$T$116, DW_AT_byte_size(0x18)
    1701                    $C$DW$156       .dwtag  DW_TAG_subrange_type
    1702                            .dwattr $C$DW$156, DW_AT_upper_bound(0x17)
    1703                            .dwendtag $C$DW$T$116
    1704                    
    1705                    
    1706                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    1707                            .dwattr $C$DW$T$21, DW_AT_name("__va_list")
    1708                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
    1709                    $C$DW$157       .dwtag  DW_TAG_member
    1710                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$3)
    1711                            .dwattr $C$DW$157, DW_AT_name("__ap")
    1712                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("__ap")
    1713                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1714                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1715                            .dwattr $C$DW$157, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/
    1716                            .dwattr $C$DW$157, DW_AT_decl_line(0x32)
    1717                            .dwattr $C$DW$157, DW_AT_decl_column(0x0c)
    1718                            .dwendtag $C$DW$T$21
    1719                    
    1720                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
    1721                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x31)
    1722                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    1723                    $C$DW$T$124     .dwtag  DW_TAG_typedef, DW_AT_name("va_list")
    1724                            .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$21)
    1725                            .dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
    1726                            .dwattr $C$DW$T$124, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/includ
    1727                            .dwattr $C$DW$T$124, DW_AT_decl_line(0x33)
    1728                            .dwattr $C$DW$T$124, DW_AT_decl_column(0x03)
    1729                    
    1730                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1731                            .dwattr $C$DW$T$24, DW_AT_name("motorMove")
    1732                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x0c)
    1733                    $C$DW$158       .dwtag  DW_TAG_member
    1734                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$13)
    1735                            .dwattr $C$DW$158, DW_AT_name("duration")
    1736                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("duration")
    1737                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1738                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1739                            .dwattr $C$DW$158, DW_AT_decl_file("../main.c")
    1740                            .dwattr $C$DW$158, DW_AT_decl_line(0xab)
    1741                            .dwattr $C$DW$158, DW_AT_decl_column(0x11)
    1742                    $C$DW$159       .dwtag  DW_TAG_member
    1743                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$23)
    1744                            .dwattr $C$DW$159, DW_AT_name("leftDirection")
    1745                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("leftDirection")
TI ARM Assembler PC v5.0.4 Tue Dec 10 12:38:37 2013

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
main.asm                                                             PAGE   34

    1746                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1747                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1748                            .dwattr $C$DW$159, DW_AT_decl_file("../main.c")
    1749                            .dwattr $C$DW$159, DW_AT_decl_line(0xac)
    1750                            .dwattr $C$DW$159, DW_AT_decl_column(0x0e)
    1751                    $C$DW$160       .dwtag  DW_TAG_member
    1752                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$9)
    1753                            .dwattr $C$DW$160, DW_AT_name("leftSpeed")
    1754                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("leftSpeed")
    1755                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1756                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1757                            .dwattr $C$DW$160, DW_AT_decl_file("../main.c")
    1758                            .dwattr $C$DW$160, DW_AT_decl_line(0xad)
    1759                            .dwattr $C$DW$160, DW_AT_decl_column(0x11)
    1760                    $C$DW$161       .dwtag  DW_TAG_member
    1761                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$23)
    1762                            .dwattr $C$DW$161, DW_AT_name("rightDirection")
    1763                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("rightDirection")
    1764                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1765                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1766                            .dwattr $C$DW$161, DW_AT_decl_file("../main.c")
    1767                            .dwattr $C$DW$161, DW_AT_decl_line(0xae)
    1768                            .dwattr $C$DW$161, DW_AT_decl_column(0x0e)
    1769                    $C$DW$162       .dwtag  DW_TAG_member
    1770                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$9)
    1771                            .dwattr $C$DW$162, DW_AT_name("rightSpeed")
    1772                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("rightSpeed")
    1773                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1774                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1775                            .dwattr $C$DW$162, DW_AT_decl_file("../main.c")
    1776                            .dwattr $C$DW$162, DW_AT_decl_line(0xaf)
    1777                            .dwattr $C$DW$162, DW_AT_decl_column(0x11)
    1778                            .dwendtag $C$DW$T$24
    1779                    
    1780                            .dwattr $C$DW$T$24, DW_AT_decl_file("../main.c")
    1781                            .dwattr $C$DW$T$24, DW_AT_decl_line(0xa9)
    1782                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    1783                    $C$DW$T$125     .dwtag  DW_TAG_typedef, DW_AT_name("tMotorMove")
    1784                            .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$24)
    1785                            .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
    1786                            .dwattr $C$DW$T$125, DW_AT_decl_file("../main.c")
    1787                            .dwattr $C$DW$T$125, DW_AT_decl_line(0xb0)
    1788                            .dwattr $C$DW$T$125, DW_AT_decl_column(0x03)
    1789                    
    1790                    $C$DW$T$126     .dwtag  DW_TAG_array_type
    1791                            .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$125)
    1792                            .dwattr $C$DW$T$126, DW_AT_language(DW_LANG_C)
    1793                            .dwattr $C$DW$T$126, DW_AT_byte_size(0x60)
    1794                    $C$DW$163       .dwtag  DW_TAG_subrange_type
    1795                            .dwattr $C$DW$163, DW_AT_upper_bound(0x07)
    1796                            .dwendtag $C$DW$T$126
    1797                    
    1798                    $C$DW$T$128     .dwtag  DW_TAG_pointer_type
    1799                            .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$125)
    1800                            .dwattr $C$DW$T$128, DW_AT_address_class(0x20)
TI ARM Assembler PC v5.0.4 Tue Dec 10 12:38:37 2013

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
main.asm                                                             PAGE   35

    1801                    
    1802                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1803                            .dwattr $C$DW$T$31, DW_AT_name("xLIST")
    1804                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x14)
    1805                    $C$DW$164       .dwtag  DW_TAG_member
    1806                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$25)
    1807                            .dwattr $C$DW$164, DW_AT_name("uxNumberOfItems")
    1808                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("uxNumberOfItems")
    1809                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1810                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1811                            .dwattr $C$DW$164, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Lab8_FreeRTOS_EvalBot\Source\i
    1812                            .dwattr $C$DW$164, DW_AT_decl_line(0x88)
    1813                            .dwattr $C$DW$164, DW_AT_decl_column(0x22)
    1814                    $C$DW$165       .dwtag  DW_TAG_member
    1815                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$28)
    1816                            .dwattr $C$DW$165, DW_AT_name("pxIndex")
    1817                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("pxIndex")
    1818                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1819                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1820                            .dwattr $C$DW$165, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Lab8_FreeRTOS_EvalBot\Source\i
    1821                            .dwattr $C$DW$165, DW_AT_decl_line(0x89)
    1822                            .dwattr $C$DW$165, DW_AT_decl_column(0x17)
    1823                    $C$DW$166       .dwtag  DW_TAG_member
    1824                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$30)
    1825                            .dwattr $C$DW$166, DW_AT_name("xListEnd")
    1826                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("xListEnd")
    1827                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1828                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1829                            .dwattr $C$DW$166, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Lab8_FreeRTOS_EvalBot\Source\i
    1830                            .dwattr $C$DW$166, DW_AT_decl_line(0x8a)
    1831                            .dwattr $C$DW$166, DW_AT_decl_column(0x19)
    1832                            .dwendtag $C$DW$T$31
    1833                    
    1834                            .dwattr $C$DW$T$31, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Lab8_FreeRTOS_EvalBot\Source\
    1835                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x86)
    1836                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    1837                    $C$DW$T$129     .dwtag  DW_TAG_typedef, DW_AT_name("xList")
    1838                            .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$31)
    1839                            .dwattr $C$DW$T$129, DW_AT_language(DW_LANG_C)
    1840                            .dwattr $C$DW$T$129, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Lab8_FreeRTOS_EvalBot\Source
    1841                            .dwattr $C$DW$T$129, DW_AT_decl_line(0x8b)
    1842                            .dwattr $C$DW$T$129, DW_AT_decl_column(0x03)
    1843                    
    1844                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1845                            .dwattr $C$DW$T$35, DW_AT_name("xLIST_ITEM")
    1846                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x14)
    1847                    $C$DW$167       .dwtag  DW_TAG_member
    1848                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$32)
    1849                            .dwattr $C$DW$167, DW_AT_name("xItemValue")
    1850                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("xItemValue")
    1851                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1852                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1853                            .dwattr $C$DW$167, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Lab8_FreeRTOS_EvalBot\Source\i
    1854                            .dwattr $C$DW$167, DW_AT_decl_line(0x73)
    1855                            .dwattr $C$DW$167, DW_AT_decl_column(0x0f)
TI ARM Assembler PC v5.0.4 Tue Dec 10 12:38:37 2013

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
main.asm                                                             PAGE   36

    1856                    $C$DW$168       .dwtag  DW_TAG_member
    1857                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$34)
    1858                            .dwattr $C$DW$168, DW_AT_name("pxNext")
    1859                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("pxNext")
    1860                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1861                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1862                            .dwattr $C$DW$168, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Lab8_FreeRTOS_EvalBot\Source\i
    1863                            .dwattr $C$DW$168, DW_AT_decl_line(0x74)
    1864                            .dwattr $C$DW$168, DW_AT_decl_column(0x1f)
    1865                    $C$DW$169       .dwtag  DW_TAG_member
    1866                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$34)
    1867                            .dwattr $C$DW$169, DW_AT_name("pxPrevious")
    1868                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("pxPrevious")
    1869                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1870                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1871                            .dwattr $C$DW$169, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Lab8_FreeRTOS_EvalBot\Source\i
    1872                            .dwattr $C$DW$169, DW_AT_decl_line(0x75)
    1873                            .dwattr $C$DW$169, DW_AT_decl_column(0x1f)
    1874                    $C$DW$170       .dwtag  DW_TAG_member
    1875                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$3)
    1876                            .dwattr $C$DW$170, DW_AT_name("pvOwner")
    1877                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("pvOwner")
    1878                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1879                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1880                            .dwattr $C$DW$170, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Lab8_FreeRTOS_EvalBot\Source\i
    1881                            .dwattr $C$DW$170, DW_AT_decl_line(0x76)
    1882                            .dwattr $C$DW$170, DW_AT_decl_column(0x09)
    1883                    $C$DW$171       .dwtag  DW_TAG_member
    1884                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$3)
    1885                            .dwattr $C$DW$171, DW_AT_name("pvContainer")
    1886                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("pvContainer")
    1887                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1888                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1889                            .dwattr $C$DW$171, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Lab8_FreeRTOS_EvalBot\Source\i
    1890                            .dwattr $C$DW$171, DW_AT_decl_line(0x77)
    1891                            .dwattr $C$DW$171, DW_AT_decl_column(0x09)
    1892                            .dwendtag $C$DW$T$35
    1893                    
    1894                            .dwattr $C$DW$T$35, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Lab8_FreeRTOS_EvalBot\Source\
    1895                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x71)
    1896                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x08)
    1897                    $C$DW$T$33      .dwtag  DW_TAG_volatile_type
    1898                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$35)
    1899                    $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    1900                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    1901                            .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    1902                    $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("xListItem")
    1903                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$35)
    1904                            .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    1905                            .dwattr $C$DW$T$26, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Lab8_FreeRTOS_EvalBot\Source\
    1906                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x79)
    1907                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x1b)
    1908                    $C$DW$T$27      .dwtag  DW_TAG_volatile_type
    1909                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    1910                    $C$DW$T$28      .dwtag  DW_TAG_pointer_type
TI ARM Assembler PC v5.0.4 Tue Dec 10 12:38:37 2013

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
main.asm                                                             PAGE   37

    1911                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    1912                            .dwattr $C$DW$T$28, DW_AT_address_class(0x20)
    1913                    
    1914                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1915                            .dwattr $C$DW$T$36, DW_AT_name("xMEMORY_REGION")
    1916                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x0c)
    1917                    $C$DW$172       .dwtag  DW_TAG_member
    1918                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$3)
    1919                            .dwattr $C$DW$172, DW_AT_name("pvBaseAddress")
    1920                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("pvBaseAddress")
    1921                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1922                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1923                            .dwattr $C$DW$172, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Lab8_FreeRTOS_EvalBot/Source/i
    1924                            .dwattr $C$DW$172, DW_AT_decl_line(0x7a)
    1925                            .dwattr $C$DW$172, DW_AT_decl_column(0x08)
    1926                    $C$DW$173       .dwtag  DW_TAG_member
    1927                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$13)
    1928                            .dwattr $C$DW$173, DW_AT_name("ulLengthInBytes")
    1929                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("ulLengthInBytes")
    1930                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1931                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1932                            .dwattr $C$DW$173, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Lab8_FreeRTOS_EvalBot/Source/i
    1933                            .dwattr $C$DW$173, DW_AT_decl_line(0x7b)
    1934                            .dwattr $C$DW$173, DW_AT_decl_column(0x10)
    1935                    $C$DW$174       .dwtag  DW_TAG_member
    1936                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$13)
    1937                            .dwattr $C$DW$174, DW_AT_name("ulParameters")
    1938                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("ulParameters")
    1939                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1940                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1941                            .dwattr $C$DW$174, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Lab8_FreeRTOS_EvalBot/Source/i
    1942                            .dwattr $C$DW$174, DW_AT_decl_line(0x7c)
    1943                            .dwattr $C$DW$174, DW_AT_decl_column(0x10)
    1944                            .dwendtag $C$DW$T$36
    1945                    
    1946                            .dwattr $C$DW$T$36, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Lab8_FreeRTOS_EvalBot/Source/
    1947                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x78)
    1948                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    1949                    $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("xMemoryRegion")
    1950                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$36)
    1951                            .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    1952                            .dwattr $C$DW$T$45, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Lab8_FreeRTOS_EvalBot/Source/
    1953                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x7d)
    1954                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x03)
    1955                    
    1956                    $C$DW$T$46      .dwtag  DW_TAG_array_type
    1957                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    1958                            .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    1959                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x0c)
    1960                    $C$DW$175       .dwtag  DW_TAG_subrange_type
    1961                            .dwattr $C$DW$175, DW_AT_upper_bound(0x00)
    1962                            .dwendtag $C$DW$T$46
    1963                    
    1964                    $C$DW$T$102     .dwtag  DW_TAG_const_type
    1965                            .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$45)
TI ARM Assembler PC v5.0.4 Tue Dec 10 12:38:37 2013

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
main.asm                                                             PAGE   38

    1966                    $C$DW$T$103     .dwtag  DW_TAG_pointer_type
    1967                            .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$102)
    1968                            .dwattr $C$DW$T$103, DW_AT_address_class(0x20)
    1969                    $C$DW$T$104     .dwtag  DW_TAG_const_type
    1970                            .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$103)
    1971                    
    1972                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1973                            .dwattr $C$DW$T$37, DW_AT_name("xMINI_LIST_ITEM")
    1974                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x0c)
    1975                    $C$DW$176       .dwtag  DW_TAG_member
    1976                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$32)
    1977                            .dwattr $C$DW$176, DW_AT_name("xItemValue")
    1978                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("xItemValue")
    1979                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1980                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1981                            .dwattr $C$DW$176, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Lab8_FreeRTOS_EvalBot\Source\i
    1982                            .dwattr $C$DW$176, DW_AT_decl_line(0x7d)
    1983                            .dwattr $C$DW$176, DW_AT_decl_column(0x0f)
    1984                    $C$DW$177       .dwtag  DW_TAG_member
    1985                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$34)
    1986                            .dwattr $C$DW$177, DW_AT_name("pxNext")
    1987                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("pxNext")
    1988                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1989                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1990                            .dwattr $C$DW$177, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Lab8_FreeRTOS_EvalBot\Source\i
    1991                            .dwattr $C$DW$177, DW_AT_decl_line(0x7e)
    1992                            .dwattr $C$DW$177, DW_AT_decl_column(0x1e)
    1993                    $C$DW$178       .dwtag  DW_TAG_member
    1994                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$34)
    1995                            .dwattr $C$DW$178, DW_AT_name("pxPrevious")
    1996                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("pxPrevious")
    1997                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1998                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1999                            .dwattr $C$DW$178, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Lab8_FreeRTOS_EvalBot\Source\i
    2000                            .dwattr $C$DW$178, DW_AT_decl_line(0x7f)
    2001                            .dwattr $C$DW$178, DW_AT_decl_column(0x1e)
    2002                            .dwendtag $C$DW$T$37
    2003                    
    2004                            .dwattr $C$DW$T$37, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Lab8_FreeRTOS_EvalBot\Source\
    2005                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x7b)
    2006                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x08)
    2007                    $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("xMiniListItem")
    2008                            .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$37)
    2009                            .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    2010                            .dwattr $C$DW$T$29, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Lab8_FreeRTOS_EvalBot\Source\
    2011                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x81)
    2012                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x20)
    2013                    $C$DW$T$30      .dwtag  DW_TAG_volatile_type
    2014                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    2015                    
    2016                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    2017                            .dwattr $C$DW$T$47, DW_AT_name("xTASK_PARAMTERS")
    2018                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x24)
    2019                    $C$DW$179       .dwtag  DW_TAG_member
    2020                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$40)
TI ARM Assembler PC v5.0.4 Tue Dec 10 12:38:37 2013

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
main.asm                                                             PAGE   39

    2021                            .dwattr $C$DW$179, DW_AT_name("pvTaskCode")
    2022                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("pvTaskCode")
    2023                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2024                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2025                            .dwattr $C$DW$179, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Lab8_FreeRTOS_EvalBot/Source/i
    2026                            .dwattr $C$DW$179, DW_AT_decl_line(0x84)
    2027                            .dwattr $C$DW$179, DW_AT_decl_column(0x0e)
    2028                    $C$DW$180       .dwtag  DW_TAG_member
    2029                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$43)
    2030                            .dwattr $C$DW$180, DW_AT_name("pcName")
    2031                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("pcName")
    2032                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2033                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2034                            .dwattr $C$DW$180, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Lab8_FreeRTOS_EvalBot/Source/i
    2035                            .dwattr $C$DW$180, DW_AT_decl_line(0x85)
    2036                            .dwattr $C$DW$180, DW_AT_decl_column(0x1c)
    2037                    $C$DW$181       .dwtag  DW_TAG_member
    2038                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$9)
    2039                            .dwattr $C$DW$181, DW_AT_name("usStackDepth")
    2040                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("usStackDepth")
    2041                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2042                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2043                            .dwattr $C$DW$181, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Lab8_FreeRTOS_EvalBot/Source/i
    2044                            .dwattr $C$DW$181, DW_AT_decl_line(0x86)
    2045                            .dwattr $C$DW$181, DW_AT_decl_column(0x11)
    2046                    $C$DW$182       .dwtag  DW_TAG_member
    2047                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$3)
    2048                            .dwattr $C$DW$182, DW_AT_name("pvParameters")
    2049                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("pvParameters")
    2050                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2051                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2052                            .dwattr $C$DW$182, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Lab8_FreeRTOS_EvalBot/Source/i
    2053                            .dwattr $C$DW$182, DW_AT_decl_line(0x87)
    2054                            .dwattr $C$DW$182, DW_AT_decl_column(0x08)
    2055                    $C$DW$183       .dwtag  DW_TAG_member
    2056                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$13)
    2057                            .dwattr $C$DW$183, DW_AT_name("uxPriority")
    2058                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("uxPriority")
    2059                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2060                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2061                            .dwattr $C$DW$183, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Lab8_FreeRTOS_EvalBot/Source/i
    2062                            .dwattr $C$DW$183, DW_AT_decl_line(0x88)
    2063                            .dwattr $C$DW$183, DW_AT_decl_column(0x19)
    2064                    $C$DW$184       .dwtag  DW_TAG_member
    2065                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$44)
    2066                            .dwattr $C$DW$184, DW_AT_name("puxStackBuffer")
    2067                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("puxStackBuffer")
    2068                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2069                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2070                            .dwattr $C$DW$184, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Lab8_FreeRTOS_EvalBot/Source/i
    2071                            .dwattr $C$DW$184, DW_AT_decl_line(0x89)
    2072                            .dwattr $C$DW$184, DW_AT_decl_column(0x12)
    2073                    $C$DW$185       .dwtag  DW_TAG_member
    2074                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$46)
    2075                            .dwattr $C$DW$185, DW_AT_name("xRegions")
TI ARM Assembler PC v5.0.4 Tue Dec 10 12:38:37 2013

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
main.asm                                                             PAGE   40

    2076                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("xRegions")
    2077                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2078                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2079                            .dwattr $C$DW$185, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Lab8_FreeRTOS_EvalBot/Source/i
    2080                            .dwattr $C$DW$185, DW_AT_decl_line(0x8a)
    2081                            .dwattr $C$DW$185, DW_AT_decl_column(0x10)
    2082                            .dwendtag $C$DW$T$47
    2083                    
    2084                            .dwattr $C$DW$T$47, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Lab8_FreeRTOS_EvalBot/Source/
    2085                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x82)
    2086                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x10)
    2087                    $C$DW$T$130     .dwtag  DW_TAG_typedef, DW_AT_name("xTaskParameters")
    2088                            .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$T$47)
    2089                            .dwattr $C$DW$T$130, DW_AT_language(DW_LANG_C)
    2090                            .dwattr $C$DW$T$130, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Lab8_FreeRTOS_EvalBot/Source
    2091                            .dwattr $C$DW$T$130, DW_AT_decl_line(0x8b)
    2092                            .dwattr $C$DW$T$130, DW_AT_decl_column(0x03)
    2093                    
    2094                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    2095                            .dwattr $C$DW$T$48, DW_AT_name("xTIME_OUT")
    2096                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x08)
    2097                    $C$DW$186       .dwtag  DW_TAG_member
    2098                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$12)
    2099                            .dwattr $C$DW$186, DW_AT_name("xOverflowCount")
    2100                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("xOverflowCount")
    2101                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2102                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2103                            .dwattr $C$DW$186, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Lab8_FreeRTOS_EvalBot/Source/i
    2104                            .dwattr $C$DW$186, DW_AT_decl_line(0x71)
    2105                            .dwattr $C$DW$186, DW_AT_decl_column(0x10)
    2106                    $C$DW$187       .dwtag  DW_TAG_member
    2107                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$32)
    2108                            .dwattr $C$DW$187, DW_AT_name("xTimeOnEntering")
    2109                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("xTimeOnEntering")
    2110                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2111                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2112                            .dwattr $C$DW$187, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Lab8_FreeRTOS_EvalBot/Source/i
    2113                            .dwattr $C$DW$187, DW_AT_decl_line(0x72)
    2114                            .dwattr $C$DW$187, DW_AT_decl_column(0x10)
    2115                            .dwendtag $C$DW$T$48
    2116                    
    2117                            .dwattr $C$DW$T$48, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Lab8_FreeRTOS_EvalBot/Source/
    2118                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x6f)
    2119                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x10)
    2120                    $C$DW$T$131     .dwtag  DW_TAG_typedef, DW_AT_name("xTimeOutType")
    2121                            .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$48)
    2122                            .dwattr $C$DW$T$131, DW_AT_language(DW_LANG_C)
    2123                            .dwattr $C$DW$T$131, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Lab8_FreeRTOS_EvalBot/Source
    2124                            .dwattr $C$DW$T$131, DW_AT_decl_line(0x73)
    2125                            .dwattr $C$DW$T$131, DW_AT_decl_column(0x03)
    2126                            .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    2127                    
    2128                    ;***************************************************************
    2129                    ;* DWARF CIE ENTRIES                                           *
    2130                    ;***************************************************************
TI ARM Assembler PC v5.0.4 Tue Dec 10 12:38:37 2013

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
main.asm                                                             PAGE   41

    2131                    
    2132                    $C$DW$CIE       .dwcie 14
    2133                            .dwcfi  cfa_register, 13
    2134                            .dwcfi  cfa_offset, 0
    2135                            .dwcfi  undefined, 0
    2136                            .dwcfi  undefined, 1
    2137                            .dwcfi  undefined, 2
    2138                            .dwcfi  undefined, 3
    2139                            .dwcfi  same_value, 4
    2140                            .dwcfi  same_value, 5
    2141                            .dwcfi  same_value, 6
    2142                            .dwcfi  same_value, 7
    2143                            .dwcfi  same_value, 8
    2144                            .dwcfi  same_value, 9
    2145                            .dwcfi  same_value, 10
    2146                            .dwcfi  same_value, 11
    2147                            .dwcfi  undefined, 12
    2148                            .dwcfi  undefined, 13
    2149                            .dwcfi  undefined, 14
    2150                            .dwcfi  undefined, 14
    2151                            .dwcfi  undefined, 7
    2152                            .dwendentry
    2153                            .dwendtag $C$DW$CU
    2154                    

--------------------------
Thumb2 Statistics
--------------------------
Number of Thumb2 ins converted to Thumb = 0 (0%)
Number of Thumb ins in input = 144 (69%)
Number of Thumb2 ins encoded as Thumb2 = 64 (100%)
Number of Thumb2 ins converted to 2 OPND Thumb = 60


No Assembly Errors, No Assembly Warnings
