TI ARM Assembler PC v5.0.4 Thu Dec 12 10:54:15 2013

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
pattern.asm                                                          PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                             PC v5.0.4 *
       3                    ;* Date/Time created: Thu Dec 12 10:54:15 2013                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=on --code_state=16 --disable_dual_state --e
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../pattern.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v5.0.4 Copyright (c) 1996-2013 Te
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("H:\EECS_388\TI_ARM_Projects\Pattern_FreeRTOS_EvalBot\Debug")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("SysCtlPeripheralEnable")

    1410                            .dwattr $C$DW$140, DW_AT_decl_line(0x90)
    1411                            .dwattr $C$DW$140, DW_AT_decl_column(0x02)
    1412                    $C$DW$141       .dwtag  DW_TAG_enumerator, DW_AT_name("eReady"), DW_AT_const_value(0x01)
    1413                            .dwattr $C$DW$141, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Pattern_FreeRTOS_EvalBot/Sourc
    1414                            .dwattr $C$DW$141, DW_AT_decl_line(0x91)
    1415                            .dwattr $C$DW$141, DW_AT_decl_column(0x02)
TI ARM Assembler PC v5.0.4 Thu Dec 12 10:54:15 2013

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
pattern.asm                                                          PAGE   28

    1416                    $C$DW$142       .dwtag  DW_TAG_enumerator, DW_AT_name("eBlocked"), DW_AT_const_value(0x02)
    1417                            .dwattr $C$DW$142, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Pattern_FreeRTOS_EvalBot/Sourc
    1418                            .dwattr $C$DW$142, DW_AT_decl_line(0x92)
    1419                            .dwattr $C$DW$142, DW_AT_decl_column(0x02)
    1420                    $C$DW$143       .dwtag  DW_TAG_enumerator, DW_AT_name("eSuspended"), DW_AT_const_value(0x03)
    1421                            .dwattr $C$DW$143, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Pattern_FreeRTOS_EvalBot/Sourc
    1422                            .dwattr $C$DW$143, DW_AT_decl_line(0x93)
    1423                            .dwattr $C$DW$143, DW_AT_decl_column(0x02)
    1424                    $C$DW$144       .dwtag  DW_TAG_enumerator, DW_AT_name("eDeleted"), DW_AT_const_value(0x04)
    1425                            .dwattr $C$DW$144, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Pattern_FreeRTOS_EvalBot/Sourc
    1426                            .dwattr $C$DW$144, DW_AT_decl_line(0x94)
    1427                            .dwattr $C$DW$144, DW_AT_decl_column(0x02)
    1428                            .dwendtag $C$DW$T$51
    1429                    
    1430                            .dwattr $C$DW$T$51, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Pattern_FreeRTOS_EvalBot/Sour
    1431                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x8f)
    1432                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x01)
    1433                    $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("eTaskState")
    1434                            .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    1435                            .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    1436                            .dwattr $C$DW$T$52, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Pattern_FreeRTOS_EvalBot/Sour
    1437                            .dwattr $C$DW$T$52, DW_AT_decl_line(0x95)
    1438                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x03)
    1439                    
    1440                    $C$DW$T$53      .dwtag  DW_TAG_enumeration_type
    1441                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x01)
    1442                    $C$DW$145       .dwtag  DW_TAG_enumerator, DW_AT_name("eAbortSleep"), DW_AT_const_value(0x00)
    1443                            .dwattr $C$DW$145, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Pattern_FreeRTOS_EvalBot/Sourc
    1444                            .dwattr $C$DW$145, DW_AT_decl_line(0x9a)
    1445                            .dwattr $C$DW$145, DW_AT_decl_column(0x02)
    1446                    $C$DW$146       .dwtag  DW_TAG_enumerator, DW_AT_name("eStandardSleep"), DW_AT_const_value(0x01)
    1447                            .dwattr $C$DW$146, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Pattern_FreeRTOS_EvalBot/Sourc
    1448                            .dwattr $C$DW$146, DW_AT_decl_line(0x9b)
    1449                            .dwattr $C$DW$146, DW_AT_decl_column(0x02)
    1450                    $C$DW$147       .dwtag  DW_TAG_enumerator, DW_AT_name("eNoTasksWaitingTimeout"), DW_AT_const_value(0x0
    1451                            .dwattr $C$DW$147, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Pattern_FreeRTOS_EvalBot/Sourc
    1452                            .dwattr $C$DW$147, DW_AT_decl_line(0x9c)
    1453                            .dwattr $C$DW$147, DW_AT_decl_column(0x02)
    1454                            .dwendtag $C$DW$T$53
    1455                    
    1456                            .dwattr $C$DW$T$53, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Pattern_FreeRTOS_EvalBot/Sour
    1457                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x99)
    1458                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x01)
    1459                    $C$DW$T$54      .dwtag  DW_TAG_typedef, DW_AT_name("eSleepModeStatus")
    1460                            .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    1461                            .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    1462                            .dwattr $C$DW$T$54, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Pattern_FreeRTOS_EvalBot/Sour
    1463                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x9d)
    1464                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x03)
    1465                    
    1466                    $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1467                            .dwattr $C$DW$T$20, DW_AT_byte_size(0x18)
    1468                    $C$DW$148       .dwtag  DW_TAG_member
    1469                            .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$10)
    1470                            .dwattr $C$DW$148, DW_AT_name("fd")
TI ARM Assembler PC v5.0.4 Thu Dec 12 10:54:15 2013

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
pattern.asm                                                          PAGE   29

    1471                            .dwattr $C$DW$148, DW_AT_TI_symbol_name("fd")
    1472                            .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1473                            .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1474                            .dwattr $C$DW$148, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/
    1475                            .dwattr $C$DW$148, DW_AT_decl_line(0x5b)
    1476                            .dwattr $C$DW$148, DW_AT_decl_column(0x0b)
    1477                    $C$DW$149       .dwtag  DW_TAG_member
    1478                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1479                            .dwattr $C$DW$149, DW_AT_name("buf")
    1480                            .dwattr $C$DW$149, DW_AT_TI_symbol_name("buf")
    1481                            .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1482                            .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1483                            .dwattr $C$DW$149, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/
    1484                            .dwattr $C$DW$149, DW_AT_decl_line(0x5c)
    1485                            .dwattr $C$DW$149, DW_AT_decl_column(0x16)
    1486                    $C$DW$150       .dwtag  DW_TAG_member
    1487                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1488                            .dwattr $C$DW$150, DW_AT_name("pos")
    1489                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("pos")
    1490                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1491                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1492                            .dwattr $C$DW$150, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/
    1493                            .dwattr $C$DW$150, DW_AT_decl_line(0x5d)
    1494                            .dwattr $C$DW$150, DW_AT_decl_column(0x16)
    1495                    $C$DW$151       .dwtag  DW_TAG_member
    1496                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1497                            .dwattr $C$DW$151, DW_AT_name("bufend")
    1498                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("bufend")
    1499                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1500                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1501                            .dwattr $C$DW$151, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/
    1502                            .dwattr $C$DW$151, DW_AT_decl_line(0x5e)
    1503                            .dwattr $C$DW$151, DW_AT_decl_column(0x16)
    1504                    $C$DW$152       .dwtag  DW_TAG_member
    1505                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1506                            .dwattr $C$DW$152, DW_AT_name("buff_stop")
    1507                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("buff_stop")
    1508                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1509                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1510                            .dwattr $C$DW$152, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/
    1511                            .dwattr $C$DW$152, DW_AT_decl_line(0x5f)
    1512                            .dwattr $C$DW$152, DW_AT_decl_column(0x16)
    1513                    $C$DW$153       .dwtag  DW_TAG_member
    1514                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$11)
    1515                            .dwattr $C$DW$153, DW_AT_name("flags")
    1516                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("flags")
    1517                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1518                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1519                            .dwattr $C$DW$153, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/
    1520                            .dwattr $C$DW$153, DW_AT_decl_line(0x60)
    1521                            .dwattr $C$DW$153, DW_AT_decl_column(0x16)
    1522                            .dwendtag $C$DW$T$20
    1523                    
    1524                            .dwattr $C$DW$T$20, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
    1525                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x5a)
TI ARM Assembler PC v5.0.4 Thu Dec 12 10:54:15 2013

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
pattern.asm                                                          PAGE   30

    1526                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
    1527                    $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("FILE")
    1528                            .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$20)
    1529                            .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    1530                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
    1531                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x61)
    1532                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x03)
    1533                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    1534                            .dwattr $C$DW$T$2, DW_AT_name("void")
    1535                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    1536                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    1537                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    1538                    $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("xTaskHandle")
    1539                            .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$3)
    1540                            .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    1541                            .dwattr $C$DW$T$56, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Pattern_FreeRTOS_EvalBot/Sour
    1542                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x6a)
    1543                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x10)
    1544                    $C$DW$T$57      .dwtag  DW_TAG_pointer_type
    1545                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    1546                            .dwattr $C$DW$T$57, DW_AT_address_class(0x20)
    1547                    
    1548                    $C$DW$T$38      .dwtag  DW_TAG_subroutine_type
    1549                            .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    1550                    $C$DW$154       .dwtag  DW_TAG_formal_parameter
    1551                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$3)
    1552                            .dwendtag $C$DW$T$38
    1553                    
    1554                    $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    1555                            .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    1556                            .dwattr $C$DW$T$39, DW_AT_address_class(0x20)
    1557                    $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("pdTASK_CODE")
    1558                            .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    1559                            .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    1560                            .dwattr $C$DW$T$40, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Pattern_FreeRTOS_EvalBot\Sour
    1561                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x4f)
    1562                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    1563                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    1564                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1565                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    1566                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1567                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    1568                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1569                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1570                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1571                    $C$DW$T$41      .dwtag  DW_TAG_const_type
    1572                            .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$5)
    1573                    $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    1574                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    1575                            .dwattr $C$DW$T$42, DW_AT_address_class(0x20)
    1576                    $C$DW$T$43      .dwtag  DW_TAG_const_type
    1577                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    1578                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    1579                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1580                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
TI ARM Assembler PC v5.0.4 Thu Dec 12 10:54:15 2013

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
pattern.asm                                                          PAGE   31

    1581                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1582                    $C$DW$T$19      .dwtag  DW_TAG_pointer_type
    1583                            .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$6)
    1584                            .dwattr $C$DW$T$19, DW_AT_address_class(0x20)
    1585                    $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("tBoolean")
    1586                            .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$6)
    1587                            .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    1588                            .dwattr $C$DW$T$71, DW_AT_decl_file("C:/TI_CodeComposer/Stellaris-EVALBOT/inc/hw_types.h")
    1589                            .dwattr $C$DW$T$71, DW_AT_decl_line(0x30)
    1590                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x17)
    1591                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    1592                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1593                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1594                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    1595                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    1596                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1597                            .dwattr $C$DW$T$8, DW_AT_name("short")
    1598                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    1599                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    1600                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1601                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1602                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    1603                    $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
    1604                            .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$9)
    1605                            .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    1606                            .dwattr $C$DW$T$93, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
    1607                            .dwattr $C$DW$T$93, DW_AT_decl_line(0x3c)
    1608                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x1a)
    1609                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    1610                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1611                            .dwattr $C$DW$T$10, DW_AT_name("int")
    1612                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    1613                    $C$DW$T$98      .dwtag  DW_TAG_typedef, DW_AT_name("ptrdiff_t")
    1614                            .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$10)
    1615                            .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    1616                            .dwattr $C$DW$T$98, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
    1617                            .dwattr $C$DW$T$98, DW_AT_decl_line(0x31)
    1618                            .dwattr $C$DW$T$98, DW_AT_decl_column(0x1c)
    1619                    $C$DW$T$11      .dwtag  DW_TAG_base_type
    1620                            .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1621                            .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    1622                            .dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
    1623                    $C$DW$T$99      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    1624                            .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$11)
    1625                            .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
    1626                            .dwattr $C$DW$T$99, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
    1627                            .dwattr $C$DW$T$99, DW_AT_decl_line(0x35)
    1628                            .dwattr $C$DW$T$99, DW_AT_decl_column(0x19)
    1629                    $C$DW$T$12      .dwtag  DW_TAG_base_type
    1630                            .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    1631                            .dwattr $C$DW$T$12, DW_AT_name("long")
    1632                            .dwattr $C$DW$T$12, DW_AT_byte_size(0x04)
    1633                    $C$DW$T$107     .dwtag  DW_TAG_volatile_type
    1634                            .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$12)
    1635                    
TI ARM Assembler PC v5.0.4 Thu Dec 12 10:54:15 2013

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
pattern.asm                                                          PAGE   32

    1636                    $C$DW$T$108     .dwtag  DW_TAG_subroutine_type
    1637                            .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$12)
    1638                            .dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
    1639                    $C$DW$155       .dwtag  DW_TAG_formal_parameter
    1640                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$3)
    1641                            .dwendtag $C$DW$T$108
    1642                    
    1643                    $C$DW$T$109     .dwtag  DW_TAG_pointer_type
    1644                            .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$108)
    1645                            .dwattr $C$DW$T$109, DW_AT_address_class(0x20)
    1646                    $C$DW$T$110     .dwtag  DW_TAG_typedef, DW_AT_name("pdTASK_HOOK_CODE")
    1647                            .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$109)
    1648                            .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
    1649                            .dwattr $C$DW$T$110, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Pattern_FreeRTOS_EvalBot/Sou
    1650                            .dwattr $C$DW$T$110, DW_AT_decl_line(0x66)
    1651                            .dwattr $C$DW$T$110, DW_AT_decl_column(0x19)
    1652                    $C$DW$T$111     .dwtag  DW_TAG_typedef, DW_AT_name("fpos_t")
    1653                            .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$12)
    1654                            .dwattr $C$DW$T$111, DW_AT_language(DW_LANG_C)
    1655                            .dwattr $C$DW$T$111, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/includ
    1656                            .dwattr $C$DW$T$111, DW_AT_decl_line(0x6d)
    1657                            .dwattr $C$DW$T$111, DW_AT_decl_column(0x0e)
    1658                    $C$DW$T$13      .dwtag  DW_TAG_base_type
    1659                            .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1660                            .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    1661                            .dwattr $C$DW$T$13, DW_AT_byte_size(0x04)
    1662                    $C$DW$T$25      .dwtag  DW_TAG_volatile_type
    1663                            .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$13)
    1664                    $C$DW$T$44      .dwtag  DW_TAG_pointer_type
    1665                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$13)
    1666                            .dwattr $C$DW$T$44, DW_AT_address_class(0x20)
    1667                    $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("portTickType")
    1668                            .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$13)
    1669                            .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    1670                            .dwattr $C$DW$T$32, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Pattern_FreeRTOS_EvalBot\Sour
    1671                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x6a)
    1672                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x1c)
    1673                    $C$DW$T$86      .dwtag  DW_TAG_pointer_type
    1674                            .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$32)
    1675                            .dwattr $C$DW$T$86, DW_AT_address_class(0x20)
    1676                    $C$DW$T$87      .dwtag  DW_TAG_const_type
    1677                            .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    1678                    $C$DW$T$14      .dwtag  DW_TAG_base_type
    1679                            .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    1680                            .dwattr $C$DW$T$14, DW_AT_name("long long")
    1681                            .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
    1682                    $C$DW$T$15      .dwtag  DW_TAG_base_type
    1683                            .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    1684                            .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    1685                            .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
    1686                    $C$DW$T$16      .dwtag  DW_TAG_base_type
    1687                            .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    1688                            .dwattr $C$DW$T$16, DW_AT_name("float")
    1689                            .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
    1690                    $C$DW$T$17      .dwtag  DW_TAG_base_type
TI ARM Assembler PC v5.0.4 Thu Dec 12 10:54:15 2013

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
pattern.asm                                                          PAGE   33

    1691                            .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    1692                            .dwattr $C$DW$T$17, DW_AT_name("double")
    1693                            .dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
    1694                    $C$DW$T$18      .dwtag  DW_TAG_base_type
    1695                            .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    1696                            .dwattr $C$DW$T$18, DW_AT_name("long double")
    1697                            .dwattr $C$DW$T$18, DW_AT_byte_size(0x08)
    1698                    $C$DW$T$66      .dwtag  DW_TAG_base_type
    1699                            .dwattr $C$DW$T$66, DW_AT_encoding(DW_ATE_unsigned_char)
    1700                            .dwattr $C$DW$T$66, DW_AT_name("unsigned char")
    1701                            .dwattr $C$DW$T$66, DW_AT_byte_size(0x01)
    1702                    $C$DW$T$67      .dwtag  DW_TAG_const_type
    1703                            .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
    1704                    $C$DW$T$68      .dwtag  DW_TAG_pointer_type
    1705                            .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
    1706                            .dwattr $C$DW$T$68, DW_AT_address_class(0x20)
    1707                    $C$DW$T$94      .dwtag  DW_TAG_pointer_type
    1708                            .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$66)
    1709                            .dwattr $C$DW$T$94, DW_AT_address_class(0x20)
    1710                    
    1711                    $C$DW$T$116     .dwtag  DW_TAG_array_type
    1712                            .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$66)
    1713                            .dwattr $C$DW$T$116, DW_AT_language(DW_LANG_C)
    1714                            .dwattr $C$DW$T$116, DW_AT_byte_size(0x18)
    1715                    $C$DW$156       .dwtag  DW_TAG_subrange_type
    1716                            .dwattr $C$DW$156, DW_AT_upper_bound(0x17)
    1717                            .dwendtag $C$DW$T$116
    1718                    
    1719                    
    1720                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    1721                            .dwattr $C$DW$T$21, DW_AT_name("__va_list")
    1722                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
    1723                    $C$DW$157       .dwtag  DW_TAG_member
    1724                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$3)
    1725                            .dwattr $C$DW$157, DW_AT_name("__ap")
    1726                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("__ap")
    1727                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1728                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1729                            .dwattr $C$DW$157, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/
    1730                            .dwattr $C$DW$157, DW_AT_decl_line(0x32)
    1731                            .dwattr $C$DW$157, DW_AT_decl_column(0x0c)
    1732                            .dwendtag $C$DW$T$21
    1733                    
    1734                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
    1735                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x31)
    1736                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    1737                    $C$DW$T$124     .dwtag  DW_TAG_typedef, DW_AT_name("va_list")
    1738                            .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$21)
    1739                            .dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
    1740                            .dwattr $C$DW$T$124, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/includ
    1741                            .dwattr $C$DW$T$124, DW_AT_decl_line(0x33)
    1742                            .dwattr $C$DW$T$124, DW_AT_decl_column(0x03)
    1743                    
    1744                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1745                            .dwattr $C$DW$T$24, DW_AT_name("motorMove")
TI ARM Assembler PC v5.0.4 Thu Dec 12 10:54:15 2013

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
pattern.asm                                                          PAGE   34

    1746                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x0c)
    1747                    $C$DW$158       .dwtag  DW_TAG_member
    1748                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$13)
    1749                            .dwattr $C$DW$158, DW_AT_name("duration")
    1750                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("duration")
    1751                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1752                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1753                            .dwattr $C$DW$158, DW_AT_decl_file("../pattern.c")
    1754                            .dwattr $C$DW$158, DW_AT_decl_line(0xab)
    1755                            .dwattr $C$DW$158, DW_AT_decl_column(0x11)
    1756                    $C$DW$159       .dwtag  DW_TAG_member
    1757                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$23)
    1758                            .dwattr $C$DW$159, DW_AT_name("leftDirection")
    1759                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("leftDirection")
    1760                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1761                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1762                            .dwattr $C$DW$159, DW_AT_decl_file("../pattern.c")
    1763                            .dwattr $C$DW$159, DW_AT_decl_line(0xac)
    1764                            .dwattr $C$DW$159, DW_AT_decl_column(0x0e)
    1765                    $C$DW$160       .dwtag  DW_TAG_member
    1766                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$9)
    1767                            .dwattr $C$DW$160, DW_AT_name("leftSpeed")
    1768                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("leftSpeed")
    1769                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1770                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1771                            .dwattr $C$DW$160, DW_AT_decl_file("../pattern.c")
    1772                            .dwattr $C$DW$160, DW_AT_decl_line(0xad)
    1773                            .dwattr $C$DW$160, DW_AT_decl_column(0x11)
    1774                    $C$DW$161       .dwtag  DW_TAG_member
    1775                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$23)
    1776                            .dwattr $C$DW$161, DW_AT_name("rightDirection")
    1777                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("rightDirection")
    1778                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1779                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1780                            .dwattr $C$DW$161, DW_AT_decl_file("../pattern.c")
    1781                            .dwattr $C$DW$161, DW_AT_decl_line(0xae)
    1782                            .dwattr $C$DW$161, DW_AT_decl_column(0x0e)
    1783                    $C$DW$162       .dwtag  DW_TAG_member
    1784                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$9)
    1785                            .dwattr $C$DW$162, DW_AT_name("rightSpeed")
    1786                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("rightSpeed")
    1787                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1788                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1789                            .dwattr $C$DW$162, DW_AT_decl_file("../pattern.c")
    1790                            .dwattr $C$DW$162, DW_AT_decl_line(0xaf)
    1791                            .dwattr $C$DW$162, DW_AT_decl_column(0x11)
    1792                            .dwendtag $C$DW$T$24
    1793                    
    1794                            .dwattr $C$DW$T$24, DW_AT_decl_file("../pattern.c")
    1795                            .dwattr $C$DW$T$24, DW_AT_decl_line(0xa9)
    1796                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    1797                    $C$DW$T$125     .dwtag  DW_TAG_typedef, DW_AT_name("tMotorMove")
    1798                            .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$24)
    1799                            .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
    1800                            .dwattr $C$DW$T$125, DW_AT_decl_file("../pattern.c")
TI ARM Assembler PC v5.0.4 Thu Dec 12 10:54:15 2013

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
pattern.asm                                                          PAGE   35

    1801                            .dwattr $C$DW$T$125, DW_AT_decl_line(0xb0)
    1802                            .dwattr $C$DW$T$125, DW_AT_decl_column(0x03)
    1803                    
    1804                    $C$DW$T$126     .dwtag  DW_TAG_array_type
    1805                            .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$125)
    1806                            .dwattr $C$DW$T$126, DW_AT_language(DW_LANG_C)
    1807                            .dwattr $C$DW$T$126, DW_AT_byte_size(0x78)
    1808                    $C$DW$163       .dwtag  DW_TAG_subrange_type
    1809                            .dwattr $C$DW$163, DW_AT_upper_bound(0x09)
    1810                            .dwendtag $C$DW$T$126
    1811                    
    1812                    $C$DW$T$128     .dwtag  DW_TAG_pointer_type
    1813                            .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$125)
    1814                            .dwattr $C$DW$T$128, DW_AT_address_class(0x20)
    1815                    
    1816                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1817                            .dwattr $C$DW$T$31, DW_AT_name("xLIST")
    1818                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x14)
    1819                    $C$DW$164       .dwtag  DW_TAG_member
    1820                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$25)
    1821                            .dwattr $C$DW$164, DW_AT_name("uxNumberOfItems")
    1822                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("uxNumberOfItems")
    1823                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1824                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1825                            .dwattr $C$DW$164, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Pattern_FreeRTOS_EvalBot\Sourc
    1826                            .dwattr $C$DW$164, DW_AT_decl_line(0x88)
    1827                            .dwattr $C$DW$164, DW_AT_decl_column(0x22)
    1828                    $C$DW$165       .dwtag  DW_TAG_member
    1829                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$28)
    1830                            .dwattr $C$DW$165, DW_AT_name("pxIndex")
    1831                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("pxIndex")
    1832                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1833                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1834                            .dwattr $C$DW$165, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Pattern_FreeRTOS_EvalBot\Sourc
    1835                            .dwattr $C$DW$165, DW_AT_decl_line(0x89)
    1836                            .dwattr $C$DW$165, DW_AT_decl_column(0x17)
    1837                    $C$DW$166       .dwtag  DW_TAG_member
    1838                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$30)
    1839                            .dwattr $C$DW$166, DW_AT_name("xListEnd")
    1840                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("xListEnd")
    1841                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1842                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1843                            .dwattr $C$DW$166, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Pattern_FreeRTOS_EvalBot\Sourc
    1844                            .dwattr $C$DW$166, DW_AT_decl_line(0x8a)
    1845                            .dwattr $C$DW$166, DW_AT_decl_column(0x19)
    1846                            .dwendtag $C$DW$T$31
    1847                    
    1848                            .dwattr $C$DW$T$31, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Pattern_FreeRTOS_EvalBot\Sour
    1849                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x86)
    1850                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    1851                    $C$DW$T$129     .dwtag  DW_TAG_typedef, DW_AT_name("xList")
    1852                            .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$31)
    1853                            .dwattr $C$DW$T$129, DW_AT_language(DW_LANG_C)
    1854                            .dwattr $C$DW$T$129, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Pattern_FreeRTOS_EvalBot\Sou
    1855                            .dwattr $C$DW$T$129, DW_AT_decl_line(0x8b)
TI ARM Assembler PC v5.0.4 Thu Dec 12 10:54:15 2013

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
pattern.asm                                                          PAGE   36

    1856                            .dwattr $C$DW$T$129, DW_AT_decl_column(0x03)
    1857                    
    1858                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1859                            .dwattr $C$DW$T$35, DW_AT_name("xLIST_ITEM")
    1860                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x14)
    1861                    $C$DW$167       .dwtag  DW_TAG_member
    1862                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$32)
    1863                            .dwattr $C$DW$167, DW_AT_name("xItemValue")
    1864                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("xItemValue")
    1865                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1866                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1867                            .dwattr $C$DW$167, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Pattern_FreeRTOS_EvalBot\Sourc
    1868                            .dwattr $C$DW$167, DW_AT_decl_line(0x73)
    1869                            .dwattr $C$DW$167, DW_AT_decl_column(0x0f)
    1870                    $C$DW$168       .dwtag  DW_TAG_member
    1871                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$34)
    1872                            .dwattr $C$DW$168, DW_AT_name("pxNext")
    1873                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("pxNext")
    1874                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1875                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1876                            .dwattr $C$DW$168, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Pattern_FreeRTOS_EvalBot\Sourc
    1877                            .dwattr $C$DW$168, DW_AT_decl_line(0x74)
    1878                            .dwattr $C$DW$168, DW_AT_decl_column(0x1f)
    1879                    $C$DW$169       .dwtag  DW_TAG_member
    1880                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$34)
    1881                            .dwattr $C$DW$169, DW_AT_name("pxPrevious")
    1882                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("pxPrevious")
    1883                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1884                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1885                            .dwattr $C$DW$169, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Pattern_FreeRTOS_EvalBot\Sourc
    1886                            .dwattr $C$DW$169, DW_AT_decl_line(0x75)
    1887                            .dwattr $C$DW$169, DW_AT_decl_column(0x1f)
    1888                    $C$DW$170       .dwtag  DW_TAG_member
    1889                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$3)
    1890                            .dwattr $C$DW$170, DW_AT_name("pvOwner")
    1891                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("pvOwner")
    1892                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1893                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1894                            .dwattr $C$DW$170, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Pattern_FreeRTOS_EvalBot\Sourc
    1895                            .dwattr $C$DW$170, DW_AT_decl_line(0x76)
    1896                            .dwattr $C$DW$170, DW_AT_decl_column(0x09)
    1897                    $C$DW$171       .dwtag  DW_TAG_member
    1898                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$3)
    1899                            .dwattr $C$DW$171, DW_AT_name("pvContainer")
    1900                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("pvContainer")
    1901                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1902                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1903                            .dwattr $C$DW$171, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Pattern_FreeRTOS_EvalBot\Sourc
    1904                            .dwattr $C$DW$171, DW_AT_decl_line(0x77)
    1905                            .dwattr $C$DW$171, DW_AT_decl_column(0x09)
    1906                            .dwendtag $C$DW$T$35
    1907                    
    1908                            .dwattr $C$DW$T$35, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Pattern_FreeRTOS_EvalBot\Sour
    1909                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x71)
    1910                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x08)
TI ARM Assembler PC v5.0.4 Thu Dec 12 10:54:15 2013

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
pattern.asm                                                          PAGE   37

    1911                    $C$DW$T$33      .dwtag  DW_TAG_volatile_type
    1912                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$35)
    1913                    $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    1914                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    1915                            .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    1916                    $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("xListItem")
    1917                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$35)
    1918                            .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    1919                            .dwattr $C$DW$T$26, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Pattern_FreeRTOS_EvalBot\Sour
    1920                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x79)
    1921                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x1b)
    1922                    $C$DW$T$27      .dwtag  DW_TAG_volatile_type
    1923                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    1924                    $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    1925                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    1926                            .dwattr $C$DW$T$28, DW_AT_address_class(0x20)
    1927                    
    1928                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1929                            .dwattr $C$DW$T$36, DW_AT_name("xMEMORY_REGION")
    1930                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x0c)
    1931                    $C$DW$172       .dwtag  DW_TAG_member
    1932                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$3)
    1933                            .dwattr $C$DW$172, DW_AT_name("pvBaseAddress")
    1934                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("pvBaseAddress")
    1935                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1936                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1937                            .dwattr $C$DW$172, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Pattern_FreeRTOS_EvalBot/Sourc
    1938                            .dwattr $C$DW$172, DW_AT_decl_line(0x7a)
    1939                            .dwattr $C$DW$172, DW_AT_decl_column(0x08)
    1940                    $C$DW$173       .dwtag  DW_TAG_member
    1941                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$13)
    1942                            .dwattr $C$DW$173, DW_AT_name("ulLengthInBytes")
    1943                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("ulLengthInBytes")
    1944                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1945                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1946                            .dwattr $C$DW$173, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Pattern_FreeRTOS_EvalBot/Sourc
    1947                            .dwattr $C$DW$173, DW_AT_decl_line(0x7b)
    1948                            .dwattr $C$DW$173, DW_AT_decl_column(0x10)
    1949                    $C$DW$174       .dwtag  DW_TAG_member
    1950                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$13)
    1951                            .dwattr $C$DW$174, DW_AT_name("ulParameters")
    1952                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("ulParameters")
    1953                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1954                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1955                            .dwattr $C$DW$174, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Pattern_FreeRTOS_EvalBot/Sourc
    1956                            .dwattr $C$DW$174, DW_AT_decl_line(0x7c)
    1957                            .dwattr $C$DW$174, DW_AT_decl_column(0x10)
    1958                            .dwendtag $C$DW$T$36
    1959                    
    1960                            .dwattr $C$DW$T$36, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Pattern_FreeRTOS_EvalBot/Sour
    1961                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x78)
    1962                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    1963                    $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("xMemoryRegion")
    1964                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$36)
    1965                            .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v5.0.4 Thu Dec 12 10:54:15 2013

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
pattern.asm                                                          PAGE   38

    1966                            .dwattr $C$DW$T$45, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Pattern_FreeRTOS_EvalBot/Sour
    1967                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x7d)
    1968                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x03)
    1969                    
    1970                    $C$DW$T$46      .dwtag  DW_TAG_array_type
    1971                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    1972                            .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    1973                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x0c)
    1974                    $C$DW$175       .dwtag  DW_TAG_subrange_type
    1975                            .dwattr $C$DW$175, DW_AT_upper_bound(0x00)
    1976                            .dwendtag $C$DW$T$46
    1977                    
    1978                    $C$DW$T$102     .dwtag  DW_TAG_const_type
    1979                            .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$45)
    1980                    $C$DW$T$103     .dwtag  DW_TAG_pointer_type
    1981                            .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$102)
    1982                            .dwattr $C$DW$T$103, DW_AT_address_class(0x20)
    1983                    $C$DW$T$104     .dwtag  DW_TAG_const_type
    1984                            .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$103)
    1985                    
    1986                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1987                            .dwattr $C$DW$T$37, DW_AT_name("xMINI_LIST_ITEM")
    1988                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x0c)
    1989                    $C$DW$176       .dwtag  DW_TAG_member
    1990                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$32)
    1991                            .dwattr $C$DW$176, DW_AT_name("xItemValue")
    1992                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("xItemValue")
    1993                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1994                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1995                            .dwattr $C$DW$176, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Pattern_FreeRTOS_EvalBot\Sourc
    1996                            .dwattr $C$DW$176, DW_AT_decl_line(0x7d)
    1997                            .dwattr $C$DW$176, DW_AT_decl_column(0x0f)
    1998                    $C$DW$177       .dwtag  DW_TAG_member
    1999                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$34)
    2000                            .dwattr $C$DW$177, DW_AT_name("pxNext")
    2001                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("pxNext")
    2002                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2003                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2004                            .dwattr $C$DW$177, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Pattern_FreeRTOS_EvalBot\Sourc
    2005                            .dwattr $C$DW$177, DW_AT_decl_line(0x7e)
    2006                            .dwattr $C$DW$177, DW_AT_decl_column(0x1e)
    2007                    $C$DW$178       .dwtag  DW_TAG_member
    2008                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$34)
    2009                            .dwattr $C$DW$178, DW_AT_name("pxPrevious")
    2010                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("pxPrevious")
    2011                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2012                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2013                            .dwattr $C$DW$178, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Pattern_FreeRTOS_EvalBot\Sourc
    2014                            .dwattr $C$DW$178, DW_AT_decl_line(0x7f)
    2015                            .dwattr $C$DW$178, DW_AT_decl_column(0x1e)
    2016                            .dwendtag $C$DW$T$37
    2017                    
    2018                            .dwattr $C$DW$T$37, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Pattern_FreeRTOS_EvalBot\Sour
    2019                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x7b)
    2020                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x08)
TI ARM Assembler PC v5.0.4 Thu Dec 12 10:54:15 2013

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
pattern.asm                                                          PAGE   39

    2021                    $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("xMiniListItem")
    2022                            .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$37)
    2023                            .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    2024                            .dwattr $C$DW$T$29, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Pattern_FreeRTOS_EvalBot\Sour
    2025                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x81)
    2026                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x20)
    2027                    $C$DW$T$30      .dwtag  DW_TAG_volatile_type
    2028                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    2029                    
    2030                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    2031                            .dwattr $C$DW$T$47, DW_AT_name("xTASK_PARAMTERS")
    2032                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x24)
    2033                    $C$DW$179       .dwtag  DW_TAG_member
    2034                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$40)
    2035                            .dwattr $C$DW$179, DW_AT_name("pvTaskCode")
    2036                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("pvTaskCode")
    2037                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2038                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2039                            .dwattr $C$DW$179, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Pattern_FreeRTOS_EvalBot/Sourc
    2040                            .dwattr $C$DW$179, DW_AT_decl_line(0x84)
    2041                            .dwattr $C$DW$179, DW_AT_decl_column(0x0e)
    2042                    $C$DW$180       .dwtag  DW_TAG_member
    2043                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$43)
    2044                            .dwattr $C$DW$180, DW_AT_name("pcName")
    2045                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("pcName")
    2046                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2047                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2048                            .dwattr $C$DW$180, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Pattern_FreeRTOS_EvalBot/Sourc
    2049                            .dwattr $C$DW$180, DW_AT_decl_line(0x85)
    2050                            .dwattr $C$DW$180, DW_AT_decl_column(0x1c)
    2051                    $C$DW$181       .dwtag  DW_TAG_member
    2052                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$9)
    2053                            .dwattr $C$DW$181, DW_AT_name("usStackDepth")
    2054                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("usStackDepth")
    2055                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2056                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2057                            .dwattr $C$DW$181, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Pattern_FreeRTOS_EvalBot/Sourc
    2058                            .dwattr $C$DW$181, DW_AT_decl_line(0x86)
    2059                            .dwattr $C$DW$181, DW_AT_decl_column(0x11)
    2060                    $C$DW$182       .dwtag  DW_TAG_member
    2061                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$3)
    2062                            .dwattr $C$DW$182, DW_AT_name("pvParameters")
    2063                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("pvParameters")
    2064                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2065                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2066                            .dwattr $C$DW$182, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Pattern_FreeRTOS_EvalBot/Sourc
    2067                            .dwattr $C$DW$182, DW_AT_decl_line(0x87)
    2068                            .dwattr $C$DW$182, DW_AT_decl_column(0x08)
    2069                    $C$DW$183       .dwtag  DW_TAG_member
    2070                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$13)
    2071                            .dwattr $C$DW$183, DW_AT_name("uxPriority")
    2072                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("uxPriority")
    2073                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2074                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2075                            .dwattr $C$DW$183, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Pattern_FreeRTOS_EvalBot/Sourc
TI ARM Assembler PC v5.0.4 Thu Dec 12 10:54:15 2013

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
pattern.asm                                                          PAGE   40

    2076                            .dwattr $C$DW$183, DW_AT_decl_line(0x88)
    2077                            .dwattr $C$DW$183, DW_AT_decl_column(0x19)
    2078                    $C$DW$184       .dwtag  DW_TAG_member
    2079                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$44)
    2080                            .dwattr $C$DW$184, DW_AT_name("puxStackBuffer")
    2081                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("puxStackBuffer")
    2082                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2083                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2084                            .dwattr $C$DW$184, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Pattern_FreeRTOS_EvalBot/Sourc
    2085                            .dwattr $C$DW$184, DW_AT_decl_line(0x89)
    2086                            .dwattr $C$DW$184, DW_AT_decl_column(0x12)
    2087                    $C$DW$185       .dwtag  DW_TAG_member
    2088                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$46)
    2089                            .dwattr $C$DW$185, DW_AT_name("xRegions")
    2090                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("xRegions")
    2091                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2092                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2093                            .dwattr $C$DW$185, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Pattern_FreeRTOS_EvalBot/Sourc
    2094                            .dwattr $C$DW$185, DW_AT_decl_line(0x8a)
    2095                            .dwattr $C$DW$185, DW_AT_decl_column(0x10)
    2096                            .dwendtag $C$DW$T$47
    2097                    
    2098                            .dwattr $C$DW$T$47, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Pattern_FreeRTOS_EvalBot/Sour
    2099                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x82)
    2100                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x10)
    2101                    $C$DW$T$130     .dwtag  DW_TAG_typedef, DW_AT_name("xTaskParameters")
    2102                            .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$T$47)
    2103                            .dwattr $C$DW$T$130, DW_AT_language(DW_LANG_C)
    2104                            .dwattr $C$DW$T$130, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Pattern_FreeRTOS_EvalBot/Sou
    2105                            .dwattr $C$DW$T$130, DW_AT_decl_line(0x8b)
    2106                            .dwattr $C$DW$T$130, DW_AT_decl_column(0x03)
    2107                    
    2108                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    2109                            .dwattr $C$DW$T$48, DW_AT_name("xTIME_OUT")
    2110                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x08)
    2111                    $C$DW$186       .dwtag  DW_TAG_member
    2112                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$12)
    2113                            .dwattr $C$DW$186, DW_AT_name("xOverflowCount")
    2114                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("xOverflowCount")
    2115                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2116                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2117                            .dwattr $C$DW$186, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Pattern_FreeRTOS_EvalBot/Sourc
    2118                            .dwattr $C$DW$186, DW_AT_decl_line(0x71)
    2119                            .dwattr $C$DW$186, DW_AT_decl_column(0x10)
    2120                    $C$DW$187       .dwtag  DW_TAG_member
    2121                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$32)
    2122                            .dwattr $C$DW$187, DW_AT_name("xTimeOnEntering")
    2123                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("xTimeOnEntering")
    2124                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2125                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2126                            .dwattr $C$DW$187, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Pattern_FreeRTOS_EvalBot/Sourc
    2127                            .dwattr $C$DW$187, DW_AT_decl_line(0x72)
    2128                            .dwattr $C$DW$187, DW_AT_decl_column(0x10)
    2129                            .dwendtag $C$DW$T$48
    2130                    
TI ARM Assembler PC v5.0.4 Thu Dec 12 10:54:15 2013

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
pattern.asm                                                          PAGE   41

    2131                            .dwattr $C$DW$T$48, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Pattern_FreeRTOS_EvalBot/Sour
    2132                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x6f)
    2133                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x10)
    2134                    $C$DW$T$131     .dwtag  DW_TAG_typedef, DW_AT_name("xTimeOutType")
    2135                            .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$48)
    2136                            .dwattr $C$DW$T$131, DW_AT_language(DW_LANG_C)
    2137                            .dwattr $C$DW$T$131, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Pattern_FreeRTOS_EvalBot/Sou
    2138                            .dwattr $C$DW$T$131, DW_AT_decl_line(0x73)
    2139                            .dwattr $C$DW$T$131, DW_AT_decl_column(0x03)
    2140                            .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    2141                    
    2142                    ;***************************************************************
    2143                    ;* DWARF CIE ENTRIES                                           *
    2144                    ;***************************************************************
    2145                    
    2146                    $C$DW$CIE       .dwcie 14
    2147                            .dwcfi  cfa_register, 13
    2148                            .dwcfi  cfa_offset, 0
    2149                            .dwcfi  undefined, 0
    2150                            .dwcfi  undefined, 1
    2151                            .dwcfi  undefined, 2
    2152                            .dwcfi  undefined, 3
    2153                            .dwcfi  same_value, 4
    2154                            .dwcfi  same_value, 5
    2155                            .dwcfi  same_value, 6
    2156                            .dwcfi  same_value, 7
    2157                            .dwcfi  same_value, 8
    2158                            .dwcfi  same_value, 9
    2159                            .dwcfi  same_value, 10
    2160                            .dwcfi  same_value, 11
    2161                            .dwcfi  undefined, 12
    2162                            .dwcfi  undefined, 13
    2163                            .dwcfi  undefined, 14
    2164                            .dwcfi  undefined, 14
    2165                            .dwcfi  undefined, 7
    2166                            .dwendentry
    2167                            .dwendtag $C$DW$CU
    2168                    

--------------------------
Thumb2 Statistics
--------------------------
Number of Thumb2 ins converted to Thumb = 0 (0%)
Number of Thumb ins in input = 144 (69%)
Number of Thumb2 ins encoded as Thumb2 = 64 (100%)
Number of Thumb2 ins converted to 2 OPND Thumb = 59


No Assembly Errors, No Assembly Warnings
